<?php
#--------------[ text section users ]--------------#
$textbotlang =[];
$textbotlang['users']['channel']['link'] = "Не настроено";
$textbotlang['users']['channel']['text_join'] = "🔗 Подписаться на канал";
$textbotlang['users']['channel']['confirmjoin'] = "✅ Проверка подписки";
$textbotlang['users']['channel']['confirmed'] = "Ваша подписка успешно подтверждена, спасибо❤️";
$textbotlang['users']['channel']['notconfirmed'] = "❌ Вы еще не подписаны на канал.";


$textbotlang['users']['Rules'] = "✅ Правила подтверждены, теперь вы можете пользоваться услугами бота.";
$textbotlang['users']['back'] = "Вы вернулись на главную страницу!";
$textbotlang['users']['backorder'] = "🏠 Вернуться к информации о сервисе";
$textbotlang['users']['spamtext'] = "Спам в боте";
$textbotlang['users']['online'] = "Онлайн";
$textbotlang['users']['offline'] = "Оффлайн";
$textbotlang['users']['unlimited'] = "Неограниченно";


$textbotlang['users']['number']['false'] = "❌ Номер телефона неверен, пожалуйста, отправьте правильный номер телефона.";
$textbotlang['users']['number']['Warning'] = "⚠️ Ошибка при сохранении номера телефона, номер должен быть обязательно для этой учетной записи";
$textbotlang['users']['number']['erroriran'] = "⭕️ Номер мобильного телефона недействителен. Приняты только иранские номера";
$textbotlang['users']['number']['active'] = "✅ Ваш номер мобильного телефона успешно подтвержден";
$textbotlang['users']['number']['Confirming'] = "📞 Пожалуйста, отправьте свой номер мобильного телефона для подтверждения";


$textbotlang['users']['sell']['service_not_available'] = "⛔️ У вас нет активных услуг";
$textbotlang['users']['sell']['service_sell'] = "🛍 Подписки, приобретенные вами
    ⚜️ Для просмотра информации нажмите на имя пользователя";
$textbotlang['users']['sell']['Service-select'] = "🛒 Локация получена, выберите сервис, который хотите купить.";
$textbotlang['users']['sell']['Service-Location'] = "❌ Ошибка 
        📝 Неверная локация сервиса";
$textbotlang['users']['sell']['error-product'] = "❌ Ошибка 
        📝 Выбранный продукт не существует";
$textbotlang['users']['sell']['None-credit'] = "🚨 Ошибка при оплате.
📝 Причина ошибки: недостаточно средств на вашем счете, сначала нужно пополнить счет

❌ Для пополнения счета выберите один из методов оплаты ниже";
$textbotlang['users']['sell']['ErrorConfig'] = "❌ Ошибка при создании подписки, для решения проблемы свяжитесь с поддержкой.";
$textbotlang['users']['sell']['selectpayment'] = "📌 Выберите способ оплаты из списка выше";


$textbotlang['users']['stateus']['notUsername'] = "⭕️ Уважаемый пользователь, если ваше имя пользователя не указано в списке выше, нажмите на кнопку ниже.";
$textbotlang['users']['stateus']['notUsernameget'] = "Имя пользователя не существует";
$textbotlang['users']['stateus']['SendUsername'] = "Отправьте свое имя пользователя";
$textbotlang['users']['stateus']['active'] = "✅ Активно";
$textbotlang['users']['stateus']['limited'] = "🚫 Конец объема";
$textbotlang['users']['stateus']['onhold'] = "⏳ Не подключено";
$textbotlang['users']['stateus']['disabled'] = "❌ Отключено";
$textbotlang['users']['stateus']['expired'] = "🔚 Время сервиса истекло";
$textbotlang['users']['stateus']['Unlimited'] = "Неограниченно";
$textbotlang['users']['stateus']['day'] = "День";
$textbotlang['users']['stateus']['Notconsumed'] = "Не использовано";
$textbotlang['users']['stateus']['username'] = "Имя пользователя: ";
$textbotlang['users']['stateus']['stateus'] = "Статус:";
$textbotlang['users']['stateus']['expirationDate'] = "Дата окончания:";
$textbotlang['users']['stateus']['daysleft'] = "Оставшееся время сервиса:";
$textbotlang['users']['stateus']['usedTrafficGb'] = "Использованный объем сервиса:";
$textbotlang['users']['stateus']['LastTraffic'] = "Общий объем сервиса:";
$textbotlang['users']['stateus']['RemainingVolume'] = "Оставшийся объем сервиса:";
$textbotlang['users']['stateus']['info'] = "📊 Информация о сервисе:";
$textbotlang['users']['stateus']['error'] = "❌ Произошла ошибка";
$textbotlang['users']['stateus']['usernotfound'] = " ❌ Пользователь не найден на сервере";
$textbotlang['users']['stateus']['getlinksub'] = "🔗 Получить ссылку на подписку";
$textbotlang['users']['stateus']['linksub'] = "🔗 Ссылка на подписку";
$textbotlang['users']['stateus']['backlist'] = "🏠 Вернуться к списку услуг";
$textbotlang['users']['stateus']['backservice'] = "🏠 Вернуться к характеристикам сервиса";
$textbotlang['users']['stateus']['Invalidusername'] = "❌ Неверное имя пользователя.
🔄 Пожалуйста, отправьте свое имя пользователя снова";
$textbotlang['users']['stateus']['manageService'] = "⚙️ Настройки сервиса";
$textbotlang['users']['stateus']['DecManageService '] = "⭕️ В этом разделе вы можете управлять своим сервисом";
$textbotlang['users']['stateus']['config'] ="🔰 Ручная конфигурация";
$textbotlang['users']['stateus']['notconnected'] ="Не подключено";


$textbotlang['users']['extend']['title'] ="📌 Продление сервиса";
$textbotlang['users']['extend']['confirm'] = "Подтвердить продление";
$textbotlang['users']['extend']['thanks'] = "Спасибо за продление вашего сервиса🙏

⭕️ Ваше продление успешно выполнено, спасибо за оплату

⬅️ Чтобы вернуться к списку своих услуг или просмотреть информацию, нажмите на кнопки ниже";
$textbotlang['users']['extend']['error'] = "❌ Произошла ошибка, для решения проблемы свяжитесь с поддержкой";
$textbotlang['users']['extend']['selectservice'] = " 🛍 Выберите продукт для продления";



$textbotlang['users']['Extra_volume']['SetPrice'] = "⭕️ Отправьте цену, которую вы хотите установить для каждого гигабайта дополнительного объема.
Текущая цена:";
$textbotlang['users']['Extra_volume']['ChangedPrice'] = "✅ Сумма успешно сохранена.";
$textbotlang['users']['Extra_volume']['sellextra'] = "➕ Купить дополнительный объем";
$textbotlang['users']['Extra_volume']['extraadded'] = "✅ Объем успешно добавлен к вашему сервису.";
$textbotlang['users']['Extra_volume']['extracheck'] = "Подтвердить и получить дополнительный объем";
$textbotlang['users']['Extra_volume']['invalidprice'] = "Минимальный объем составляет 1 гигабайт";

$textbotlang['users']['usertest']['limitwarning'] = "⚠️ Предел создания тестовой подписки истек.";
$textbotlang['users']['usertest']['errorcreat'] = "❌ Произошла ошибка при создании подписки, для решения проблемы свяжитесь с поддержкой.";
$textbotlang['users']['usertest']['iduser'] = "Идентификатор пользователя";
$textbotlang['users']['usertest']['phonenumber'] = "Номер телефона пользователя";
$textbotlang['users']['usertest']['namepanel'] = "Имя панели";



$textbotlang['users']['help']['disablehelp'] = "Уважаемый пользователь, раздел обучения в данный момент отключен. 😔";
$textbotlang['users']['help']['btninlinebuy'] = "📚 Просмотр инструкции по использованию";


$textbotlang['users']['support']['sendmessageadmin'] = "🚀 Ваше сообщение отправлено, ожидайте ответа от администрации";
$textbotlang['users']['support']['answermessage'] = "Ответ на сообщение";
$textbotlang['users']['support']['sendmessageuser'] = "📨 Для связи с поддержкой отправьте ваше сообщение";
$textbotlang['users']['support']['btnsupport'] = "☎️ Внизу (часто задаваемые вопросы) вы найдете ответы на ваши вопросы. Нажмите на кнопку ниже, если не нашли ответ, нажмите на кнопку поддержки";


$textbotlang['users']['Balance']['priceinput'] = "💸 Введите сумму в тумах:
✅ Максимальная сумма 10.000.000 тумах";
$textbotlang['users']['Balance']['errorprice'] = "❌ Ошибка 
💬 Пожалуйста, введите только число
Числа должны быть латинскими (клавиатура на английском)";
$textbotlang['users']['Balance']['errorpricelimit'] = "❌ Ошибка 
        💬 Сумма должна быть меньше 10 миллионов тумах и больше 20 тысяч тумах";
$textbotlang['users']['Balance']['selectPatment'] = "💵 Выберите способ оплаты";
$textbotlang['users']['Balance']['nowpayments'] = "❌ Ошибка 
    Минимальная сумма для оплаты в этом платёжном шлюзе составляет 1 доллар.";
$textbotlang['users']['Balance']['zarinpal'] = "❌ Ошибка 
    Минимальная сумма для оплаты в этом платёжном шлюзе составляет 5000 тумах.";
$textbotlang['users']['Balance']['linkpayments'] = "Создание ссылки для оплаты...";
$textbotlang['users']['Balance']['payments'] = "Оплата";
$textbotlang['users']['Balance']['changeto'] = "❌ Ошибка 
    Минимальная сумма для оплаты в этом платёжном шлюзе составляет 2 трона";
$textbotlang['users']['Balance']['errorLinkPayment'] = "❌ Произошла ошибка при создании ссылки для оплаты, свяжитесь с поддержкой для решения проблемы.";
$textbotlang['users']['Balance']['reject_pay']  = "❌ Отказ от оплаты";
$textbotlang['users']['Balance']['Confirmpayadmin']  = "⭕️ Оплата была предварительно подтверждена";
$textbotlang['users']['Balance']['finished'] = "Ваша оплата успешно подтверждена";
$textbotlang['users']['Balance']['sending'] = "Оплата получена и находится на проверке, пожалуйста, подождите";
$textbotlang['users']['Balance']['expired'] = "Срок действия ссылки для оплаты истек и не подлежит проверке";
$textbotlang['users']['Balance']['refunded'] = "Сумма возвращена в ваш кошелек";
$textbotlang['users']['Balance']['waiting'] = "Ожидание подтверждения оплаты";
$textbotlang['users']['Balance']['Failed'] = "⭕️ Ваша оплата не была подтверждена";
$textbotlang['users']['Balance']['Confirmpay']  = "✅ Уважаемый пользователь, ваша оплата успешно выполнена, и сумма была добавлена к вашему балансу";
$textbotlang['users']['Balance']['Invalid-receipt'] = "Квитанция недействительна, квитанция должна быть только изображением";
$textbotlang['users']['Balance']['Confirmpaying']  = "✅ Подтверждение оплаты";
$textbotlang['users']['Balance']['Send-receipt'] ="🚀 Ваша квитанция об оплате отправлена, после подтверждения администрацией сумма будет зачислена на ваш кошелек";


$textbotlang['users']['changelink']['btntitle'] = "⚙️ Обновление подписки";
$textbotlang['users']['changelink']['warnchange'] = "⚠️ При обновлении ссылки на подписку конфигурация вашего сервиса будет прервана, и вам нужно будет получить новую конфигурацию или ссылку на подписку в разделе настроек сервиса.";
$textbotlang['users']['changelink']['confirm'] = "Изменение ссылки подключения";
$textbotlang['users']['changelink']['confirmed'] = "✅ Ваша ссылка подключения обновлена, предыдущая конфигурация прервана. Для получения новой конфигурации перейдите в меню настроек сервиса и получите новую конфигурацию.";


$textbotlang['users']['removeconfig']['btnremoveuser'] = "💸 Возврат средств";
$textbotlang['users']['removeconfig']['rejectremove'] = "❌ Отказ в удалении";
$textbotlang['users']['removeconfig']['accepetrequest'] = "✅ Ваш запрос отправлен, после проверки администрации вы получите уведомление о результате";
$textbotlang['users']['stateus']['notusername'] = "❌ Удаление сервиса невозможно.";
$textbotlang['users']['stateus']['errorexits'] = "❌ Запрос уже был подан, пожалуйста, подождите, пока предыдущий запрос будет проверен, затем отправьте новый запрос.";
$textbotlang['users']['stateus']['descriptions_removeservice'] = "Нажав на кнопку \"✅ Я хочу удалить сервис\", вы отправите запрос на удаление сервиса администрации, и после проверки ваш сервис будет отменен.\n\n❌ В случае одобрения администрации остаток потребленных средств будет зачислен на ваш кошелек.\n\nСпасибо, что воспользовались нашими услугами.";
$textbotlang['users']['stateus']['exitsrequsts'] = "❌ У вас есть зарегистрированный запрос, ожидайте проверки зарегистрированного запроса, после проверки вы сможете подать запрос на удаление";
$textbotlang['users']['stateus']['sendrequestsremove'] ="📌 Нажав на кнопку \"✅ Я хочу удалить сервис\", вы отправите запрос на удаление сервиса администрации, и после проверки ваш сервис будет отменен.\n\n❌ В случае одобрения администрации остаток потребленных средств будет зачислен на ваш кошелек.\n\nСпасибо, что воспользовались нашими услугами.";


$textbotlang['users']['perfectmoney']['getvcode'] = "⭕️ Чтобы увеличить баланс, сначала отправьте код вашего ваучера Perfect Money.";
$textbotlang['users']['perfectmoney']['getvnumber'] = "⭕️ Ваучер получен, теперь отправьте код активации.";
$textbotlang['users']['perfectmoney']['errors'] = "❌ Произошла ошибка при проверке ваучера. Пожалуйста, свяжитесь с поддержкой для решения проблемы.";
$textbotlang['users']['perfectmoney']['invalidvcodeorev'] = "❌ Отправленный ваучер недействителен.";
$textbotlang['users']['perfectmoney']['invalidvcode'] = "❌ Отправленный код ваучера недействителен.";
$textbotlang['users']['perfectmoney']['invalid_ev_number'] = "❌ Отправленный код активации недействителен.";

$textbotlang['users']['perfectmoney']['getvcode'] = "⭕️ Чтобы увеличить баланс, сначала отправьте код вашего ваучера Perfect Money.";
$textbotlang['users']['perfectmoney']['getvnumber'] = "⭕️ Ваучер получен, теперь отправьте код активации.";
$textbotlang['users']['perfectmoney']['errors'] = "❌ Произошла ошибка при проверке ваучера. Пожалуйста, свяжитесь с поддержкой для решения проблемы.";
$textbotlang['users']['perfectmoney']['invalidvcodeorev'] = "❌ Отправленный ваучер недействителен.";
$textbotlang['users']['perfectmoney']['invalidvcode'] = "❌ Отправленный код ваучера недействителен.";
$textbotlang['users']['perfectmoney']['invalid_ev_number'] = "❌ Отправленный код активации недействителен.";


$textbotlang['users']['Discount']['getcode']  = "💝 Для получения баланса отправьте свой подарочный код";
$textbotlang['users']['Discount']['notcode']  = "❌ Код недействителен";
$textbotlang['users']['Discount']['onecode']  = "⭕️ Этот код можно использовать только один раз";
$textbotlang['users']['Discount']['getcodesell']  = "🧑‍💻 Отправьте свой скидочный код";
$textbotlang['users']['Discount']['correctcode']  = "🤩 Ваш скидочный код верен, и сумма была применена к вашему счету.";
$textbotlang['users']['Discount']['erorrlimit']  = "❌ Лимит использования этого скидочного кода истек";
$textbotlang['users']['Discount']['erorrlimitdiscount']  = "❌ Лимит использования этого подарочного кода истек";
$textbotlang['users']['Discount']['firstdiscount']  = "❌ Этот скидочный код предназначен для первой покупки";


#--------------[ other users ]--------------#
$textbotlang['users']['backhome'] = "🏠 Вернуться в главное меню";
$textbotlang['users']['time-Service'] = "⏳ Время подписки";
$textbotlang['users']['Volume-Service'] = "🌐 Объем сервиса";
$textbotlang['users']['selectoption'] = "Выберите вариант";
$textbotlang['users']['page']['next'] = "Далее";
$textbotlang['users']['page']['previous'] = "Назад";
$textbotlang['users']['Service']['Location'] = "🌏 Выберите местоположение вашего сервиса.";
$textbotlang['users']['config'] = "Ваши конфигурации:";
$textbotlang['users']['Invalid-comment'] = "❌ Неверная команда ❌";
$textbotlang['users']['selectusername'] = "Отправьте свое имя пользователя
⚠️ Имя пользователя должно быть без лишних символов, таких как @, пробелы, дефисы. 
⚠️ Имя пользователя должно быть на английском";
$textbotlang['users']['invalidusername'] ="❌ Имя пользователя недействительно
🔄 Пожалуйста, отправьте свое имя пользователя снова";


$textbotlang['users']['affiliates']['setpercentage'] = "📌 Укажите процент, который вы хотите зачислить пользователю после покупки";
$textbotlang['users']['affiliates']['changedpercentage'] = "✅ Процент зачисления пользователю успешно установлен";
$textbotlang['users']['affiliates']['banner'] = "⭕️ Отправьте баннер для привлечения партнеров 
❌ Баннер должен быть обязательно с изображением";
$textbotlang['users']['affiliates']['affiliatesyou'] = "❌ Невозможно стать вашим партнером с этим именем пользователя";
$textbotlang['users']['affiliates']['invalidbanner'] = "❌ Отправленный баннер недействителен (баннер обязательно должен быть с изображением)";
$textbotlang['users']['affiliates']['insertbanner'] = "✅ Ваш баннер успешно зарегистрирован.";
$textbotlang['users']['affiliates']['invalidaffiliates'] = "❌ Вы не можете быть своим собственным партнером";
$textbotlang['users']['affiliates']['priceDiscount'] = "📌 Укажите сумму, которую пользователь получит с каждым новым партнером";
$textbotlang['users']['affiliates']['changedpriceDiscount'] = "✅ Сумма для партнеров успешно зарегистрирована";
$textbotlang['users']['affiliates']['offaffiliates'] = "❌ Раздел привлечения партнеров отключен";

#--------------[ admin ]--------------#

$textbotlang['Admin']['Back-Admin'] = "Вы вернулись в панель администратора!";
$textbotlang['Admin']['not-user'] = "Пользователь с этим идентификатором не найден";


$textbotlang['Admin']['channel']['join-channel-on'] = "Обязательное членство включено
❌❌ Для работы обязательного членства бот должен быть администратором канала.";
$textbotlang['Admin']['channel']['join-channel-off'] = "Обязательное членство отключено";
$textbotlang['Admin']['channel']['changechannel'] = "Чтобы настроить канал обязательного членства, пожалуйста, введите идентификатор вашего канала без @.
    Ваш текущий канал: @";
$textbotlang['Admin']['channel']['setchannel'] = "🔰 Канал успешно настроен.
    Чтобы включить обязательное членство, нажмите кнопку 📣 Настройка обязательного членства в меню администратора";


$textbotlang['Admin']['manageadmin']['getid'] ="🌟 Пожалуйста, отправьте числовой идентификатор администратора";
$textbotlang['Admin']['manageadmin']['addadminset'] ="🥳 Администратор успешно добавлен";
$textbotlang['Admin']['manageadmin']['setrule'] ="⭕️ Укажите уровень доступа администратора
Уровень доступа administrator имеет доступ ко всем разделам
Уровень доступа Seller имеет доступ только к разделам подтверждения квитанций, услуг пользователя, статистики бота
Уровень доступа support имеет доступ к разделам услуг пользователя, ответам на сообщения поддержки";
$textbotlang['Admin']['manageadmin']['removedadmin'] ="✅ Администратор успешно удален.";
$textbotlang['Admin']['manageadmin']['invalidrule'] ="❌ Неверный уровень доступа";


$textbotlang['Admin']['manageusertest']['getidlimit'] = " ⚜️ Пожалуйста, отправьте числовой идентификатор пользователя
Описание: в этом разделе вы можете изменить лимит на создание тестовых аккаунтов для пользователя. По умолчанию лимит равен 1.";
$textbotlang['Admin']['getlimitusertest']['getid'] = "Идентификатор получен, пожалуйста, отправьте количество создаваемых тестовых аккаунтов";
$textbotlang['Admin']['getlimitusertest']['setlimit'] = "Лимит для пользователя установлен.";
$textbotlang['Admin']['getlimitusertest']['limitall'] = "Введите количество создаваемых тестовых аккаунтов.";
$textbotlang['Admin']['getlimitusertest']['setlimitall'] = "Лимит на создание аккаунтов для всех пользователей установлен";

$textbotlang['Admin']['sumuser'] = "👤 Количество пользователей";
$textbotlang['Admin']['sumusertest'] = "🖥 Общее количество тестовых аккаунтов";
$textbotlang['Admin']['phpversion'] = "👨‍💻 Версия php хостинга";
$textbotlang['Admin']['pingbot'] = "🚀 Пинг бота";
$textbotlang['Admin']['sellservices'] = "🛍 Общая продажа";
$textbotlang['Admin']['dayListSell'] = "☀️ Продажа сегодня";
$textbotlang['Admin']['Balanceall'] = "💰 Общий баланс пользователей";
$textbotlang['Admin']['sumporoduct'] = "🛍 Общее количество заказов";


$textbotlang['Admin']['managepanel']['selectpanel'] = "Выберите свою панель";
$textbotlang['Admin']['managepanel']['connectx-ui'] = "✅ Панель подключена";
$textbotlang['Admin']['managepanel']['errorstateuspanel'] = "Не удалось подключиться к панели 😔
            
⭕️ Если вы ввели домен в соответствии с заявленными условиями, эта ошибка вызвана закрытым выходом порта панели на хосте бота.
    
Первое решение: измените порт панели на 443 или 8080, эти порты всегда открыты.
⚠️ Если порт панели 443, иногда работает с портом 443, иногда без порта.
Второе решение: отправьте тикет в поддержку хостинга и сообщите, чтобы открыли порт вашей панели на сервере.";
$textbotlang['Admin']['managepanel']['addpanelname']= "Чтобы добавить панель к боту, сначала отправьте имя для своей панели.
                
⚠️ Внимание: имя панели — это то, что будет отображаться при выполнении операций поиска.";
$textbotlang['Admin']['managepanel']['addpanelurl'] = "🔗 Имя панели сохранено, теперь отправьте адрес своей панели.
    ⚠️ Внимание:
    🔸 Адрес панели должен быть отправлен без dashboard.
    🔹 Если порт панели 443, порт вводить не нужно. (Иногда нужно вводить с портом.)
    🔸 В конце адреса не должно быть /.
    🔹 Если вы вводите IP, он должен начинаться с http или https.";
$textbotlang['Admin']['managepanel']['Invalid-domain'] = "🔗 Адрес домена недействительный";
$textbotlang['Admin']['managepanel']['usernameset'] ="👤 Адрес панели сохранен, теперь отправьте имя пользователя";
$textbotlang['Admin']['managepanel']['getpassword'] = "🔑 Введите пароль вашей панели";
$textbotlang['Admin']['managepanel']['addedpanel'] = "Поздравляем, ваша панель была успешно добавлена";
$textbotlang['Admin']['managepanel']['GetRemoveNamePanel'] = "Выберите панель, которую хотите удалить.";
$textbotlang['Admin']['managepanel']['RemovedPanel'] = "Панель успешно удалена";
$textbotlang['Admin']['managepanel']['nullpanel'] = "⭕️ Позиция не найдена, чтобы решить проблему, свяжитесь с поддержкой";
$textbotlang['Admin']['managepanel']['nullpaneladmin'] = "Панель не определена, сначала определите панель, затем добавьте продукт";
$textbotlang['Admin']['managepanel']['getloc'] = "Чтобы отредактировать панель, отправьте имя панели";
$textbotlang['Admin']['managepanel']['GetNameNew'] = "Отправьте новое имя панели";
$textbotlang['Admin']['managepanel']['ChangedNmaePanel'] = "✅ Имя панели успешно изменено.";
$textbotlang['Admin']['managepanel']['geturlnew'] = "Отправьте новый адрес панели";
$textbotlang['Admin']['managepanel']['ChangedurlPanel'] = "✅ Адрес панели успешно изменен.";
$textbotlang['Admin']['managepanel']['Repeatpanel'] = "❌ Имя панели уже зарегистрировано, вы не можете зарегистрировать его снова";
$textbotlang['Admin']['managepanel']['customnamesend'] = "Отправьте свой текст";
$textbotlang['Admin']['managepanel']['invalidname'] = "Недействительное имя";
$textbotlang['Admin']['managepanel']['savedname'] = "✅ Имя успешно сохранено";
$textbotlang['Admin']['managepanel']['getusernamenew'] = "Отправьте новое имя пользователя панели";
$textbotlang['Admin']['managepanel']['ChangedusernamePanel'] = "✅ Имя пользователя панели успешно изменено.";
$textbotlang['Admin']['managepanel']['getpasswordnew'] = "Отправьте новый пароль панели";
$textbotlang['Admin']['managepanel']['ChangedpasswordPanel'] = "✅ Пароль панели успешно изменен.";

$textbotlang['Admin']['ManageUser']['SendMessageuser'] = "✅ Сообщение успешно отправлено пользователю.";
$textbotlang['Admin']['ManageUser']['GetTextResponse'] = "Для ответа пользователю отправьте свой текст.";
$textbotlang['Admin']['ManageUser']['GetText'] = "Отправьте свой текст";
$textbotlang['Admin']['ManageUser']['ForwardGetext'] = "Отправьте свой пересылаемый текст";
$textbotlang['Admin']['ManageUser']['ForwardSendAllUser'] = "✅ Сообщение было переслано всем пользователям.";
$textbotlang['Admin']['ManageUser']['MessageSent'] = "✅ Сообщение отправлено";
$textbotlang['Admin']['ManageUser']['ChangeTextGet'] = "Отправьте свой новый текст.
Текущий текст:";
$textbotlang['Admin']['ManageUser']['GetIDMessage'] = "✅ Текст получен, теперь отправьте числовой ID пользователя.";
$textbotlang['Admin']['ManageUser']['ErrorText'] = "Вы можете отправлять только текст";
$textbotlang['Admin']['ManageUser']['SaveText'] = "✅ Текст успешно сохранен";
$textbotlang['Admin']['ManageUser']['BlockUserId'] = "👤 Отправьте числовой ID пользователя";
$textbotlang['Admin']['ManageUser']['BlockedUser'] = "Пользователь уже был заблокирован❗️";
$textbotlang['Admin']['ManageUser']['BlockUser'] = "🚫 Пользователь заблокирован, теперь отправьте причину блокировки.";
$textbotlang['Admin']['ManageUser']['RemoveService'] = "В этом разделе вы можете удалить сервис внутри бота.
Для удаления сервиса отправьте имя пользователя, которое было зарегистрировано в панели.";
$textbotlang['Admin']['ManageUser']['RemovedService'] = "✅ Сервис пользователя успешно удален.";
$textbotlang['Admin']['ManageUser']['DescriptionBlock'] = "✍️ Причина блокировки пользователя сохранена";
$textbotlang['Admin']['ManageUser']['GetIdUserunblock'] = "👤 Отправьте числовой ID пользователя";
$textbotlang['Admin']['ManageUser']['UserNotBlock'] = "Пользователь не заблокирован 😐";
$textbotlang['Admin']['ManageUser']['UserUnblocked'] = "Пользователь разблокирован. 🤩";
$textbotlang['Admin']['ManageUser']['Acceptedphone'] = "Подтверждено";
$textbotlang['Admin']['ManageUser']['Failedphone'] = "Не подтверждено";
$textbotlang['Admin']['ManageUser']['Userid'] = "🔵 Числовой ID пользователя";
$textbotlang['Admin']['ManageUser']['LimitUsertest'] = "🔵 Ограничение тестового аккаунта";
$textbotlang['Admin']['ManageUser']['rollUser'] = "🔵 Статус подтверждения правил";
$textbotlang['Admin']['ManageUser']['PhoneUser'] = "🔵 Номер телефона";
$textbotlang['Admin']['ManageUser']['BalanceUser'] = "🔵 Баланс пользователя";
$textbotlang['Admin']['ManageUser']['ViewInfo'] = "👀 Информация о пользователе: ";
$textbotlang['Admin']['ManageUser']['ViewOrder'] = "👁 Для просмотра заказов пользователя отправьте числовой ID пользователя";
$textbotlang['Admin']['ManageUser']['dataorder'] = "Дата не зарегистрирована";
$textbotlang['Admin']['ManageUser']['SendOrder'] = "Список заказов пользователя отправлен";
$textbotlang['Admin']['ManageUser']['mangebtnuser'] = "⚙️ Управление пользователем";
$textbotlang['Admin']['ManageUser']['mangebtnuserdec'] = "⭕️ В этом разделе вы можете просмотреть всех пользователей 
⚠️ Для управления пользователем нажмите кнопку управления пользователем рядом с каждым пользователем";
$textbotlang['Admin']['ManageUser']['backlistuser'] = "🏠 Вернуться к списку пользователей";
$textbotlang['Admin']['ManageUser']['addbalanceuser'] = "👆 Увеличить баланс";
$textbotlang['Admin']['ManageUser']['lowbalanceuser'] = "👇 Уменьшить баланс";
$textbotlang['Admin']['ManageUser']['addbalanceuserdec'] = "⭕️ Отправьте сумму, которую хотите добавить";
$textbotlang['Admin']['ManageUser']['lowbalanceuserdec'] = "⭕️ Отправьте сумму, которую хотите вычесть";
$textbotlang['Admin']['ManageUser']['addbalanced'] = "✅ Баланс успешно добавлен на счет пользователя.";
$textbotlang['Admin']['ManageUser']['lowbalanced'] = "✅ Баланс успешно вычтен со счета пользователя.";
$textbotlang['Admin']['Balance']['AddBalanceUsers'] = "✅ Сумма добавлена к балансу пользователей";
$textbotlang['Admin']['ManageUser']['banuserlist'] = "🔒 Заблокировать пользователя";
$textbotlang['Admin']['ManageUser']['unbanuserlist'] = "🔓 Разблокировать пользователя";
$textbotlang['Admin']['ManageUser']['confirmnumber'] = "Ручное подтверждение номера телефона";
$textbotlang['Admin']['ManageUser']['vieworderuser'] = "🛍 Просмотреть заказы пользователя";
$textbotlang['Admin']['ManageUser']['viewpaymentuser'] = "💰 Просмотреть платежи пользователя";
$textbotlang['Admin']['ManageUser']['sendpayemntlist'] = "✅ Список платежей пользователя отправлен";
$textbotlang['Admin']['ManageUser']['removeservice'] = "❌ Удалить заказ";
$textbotlang['Admin']['ManageUser']['removeserviceandback'] = "❌ Удалить заказ и вернуть сумму";

$textbotlang['Admin']['Help']['GetAddNameHelp'] ="Чтобы добавить обучение, отправьте имя
⚠️ Внимание: имя обучения — это то, что пользователь видит в списке.";
$textbotlang['Admin']['Help']['GetAddDecHelp'] = " 🔗 Имя обучения сохранено, теперь отправьте свои объяснения
⚠️ Внимание:
🔸 Объяснения можно отправлять с фото или видео";
$textbotlang['Admin']['Help']['SaveHelp'] = "✅ Обучение успешно сохранено";
$textbotlang['Admin']['Help']['SelectName'] = "Выберите имя обучения";
$textbotlang['Admin']['Help']['RemoveHelp'] = "✅ Обучение удалено.";

$textbotlang['Admin']['Status']['btn'] ="📈 Статистика вашего бота";
$textbotlang['Admin']['Status']['BotTitle'] = "Статус бота";
$textbotlang['Admin']['Status']['onhold'] = "Статус возможности первого подключения сервиса";
$textbotlang['Admin']['Status']['onstatus'] = "Включено";
$textbotlang['Admin']['Status']['offstatus'] = "Выключено";
$textbotlang['Admin']['Status']['BotStatusOff'] = "❌ Бот выключен";
$textbotlang['Admin']['Status']['BotStatuson'] = "🤖 Бот включен";
$textbotlang['Admin']['Status']['UsernameTitle'] = "Статус кнопки имени пользователя
Если эта функция активирована, в разделе управления сервисами появится дополнительная кнопка, с помощью которой пользователь может отправить имя пользователя и просмотреть информацию о своем аккаунте.";
$textbotlang['Admin']['Status']['UsernameStatusOff'] = "Статус кнопки имени пользователя выключен";
$textbotlang['Admin']['Status']['UsernameStatuson'] = "Кнопка имени пользователя включена";
$textbotlang['Admin']['Status']['rollTitle'] = "Статус правил";
$textbotlang['Admin']['Status']['rollStatusOff'] = "❌ Правило деактивировано";
$textbotlang['Admin']['Status']['rollStatuson'] = "♨️ Правило активировано. Теперь, если пользователь не подтвердил правила, он не сможет использовать функции бота";
$textbotlang['Admin']['Status']['phoneTitle'] = "📞 Статус подтверждения номера телефона";
$textbotlang['Admin']['Status']['phoneStatusOff'] = "❌ Подтверждение номера телефона деактивировано";
$textbotlang['Admin']['Status']['phoneStatuson'] = "🥳 Подтверждение номера телефона активировано. Теперь каждый пользователь, который хочет использовать услуги бота, должен отправить свой номер телефона.";
$textbotlang['Admin']['Status']['HelpTitle'] = "Статус раздела обучения";
$textbotlang['Admin']['Status']['HelpStatusOff'] = "❌ Обучение отключено";
$textbotlang['Admin']['Status']['HelpStatuson'] = "📚 Раздел обучения включен";
$textbotlang['Admin']['Status']['PhoneIranTitle'] = "В этом разделе вы можете определить, чтобы при подтверждении номера телефона у пользователя принимался только иранский номер или все номера";
$textbotlang['Admin']['Status']['PhoneIranStatusOff'] = "❌ Подтверждение номера от пользователей с любыми номерами теперь возможно.";
$textbotlang['Admin']['Status']['PhoneIranStatuson'] = "🇮🇷 Подтверждение номера телефона только для иранских номеров активировано";
$textbotlang['Admin']['Status']['subTitle'] = "В этом разделе вы можете настроить, получит ли пользователь ссылку на подписку после покупки или нет";
$textbotlang['Admin']['Status']['subStatusOff'] = "⭕️ Отправка ссылки на подписку отключена. Теперь пользователь не получит ссылку на подписку после покупки.";
$textbotlang['Admin']['Status']['subStatuson'] = "Ссылка на подписку активирована. Теперь после покупки пользователь получит ссылку на подписку";
$textbotlang['Admin']['Status']['configTitle'] = "В этом разделе вы можете определить, получит ли пользователь ручные конфигурации после покупки";
$textbotlang['Admin']['Status']['configStatusOff'] = "⭕️ Отправка ручной конфигурации отключена. Теперь пользователь не получит ручную конфигурацию после покупки.";
$textbotlang['Admin']['Status']['configStatuson'] = "Отправка конфигурации после покупки активирована, теперь пользователи также получат ручные конфигурации";
$textbotlang['Admin']['Status']['cardTitle'] = "В этом разделе вы можете включить или выключить офлайн-терминал";
$textbotlang['Admin']['Status']['cardStatusOff'] = "⭕ Статус офлайн-терминала выключен";
$textbotlang['Admin']['Status']['cardStatuson'] = "Статус офлайн-терминала включен";
$textbotlang['Admin']['Status']['nowpaymentsTitle'] = "В этом разделе вы можете активировать или деактивировать терминал NewPayment";
$textbotlang['Admin']['Status']['nowpaymentsStatusOff'] = "⭕ Статус терминала выключен";
$textbotlang['Admin']['Status']['nowpaymentsStatuson'] = "Статус терминала включен";
$textbotlang['Admin']['Status']['digiTitle'] = "В этом разделе вы можете активировать или деактивировать терминал Swapino";
$textbotlang['Admin']['Status']['digiStatusOff'] = "⭕ Терминал выключен";
$textbotlang['Admin']['Status']['digiStatuson'] = "Терминал включен";
$textbotlang['Admin']['Status']['zarinpalTitle'] = "В этом разделе вы можете активировать или деактивировать терминал Zarin Pal";
$textbotlang['Admin']['Status']['zarrinpalStatusOff'] = "⭕ Терминал выключен";
$textbotlang['Admin']['Status']['zarinpalStatuson'] = "Терминал включен";
$textbotlang['Admin']['Status']['aqayepardakhtTitle'] = "В этом разделе вы можете активировать или деактивировать терминал Mr. Payment";
$textbotlang['Admin']['Status']['aqayepardakhtStatusOff'] = "⭕ Терминал выключен";
$textbotlang['Admin']['Status']['aqayepardakhtStatuson'] = "Терминал включен";
$textbotlang['Admin']['Status']['perfectmoneyTitle'] = "В этом разделе вы можете активировать или деактивировать терминал Perfect Money";
$textbotlang['Admin']['Status']['perfectmoneyStatusOff'] = "⭕ Терминал выключен";
$textbotlang['Admin']['Status']['perfectmoneyStatuson'] = "Терминал включен";
$textbotlang['Admin']['Status']['affiliates'] = "📌 В этом разделе вы можете включить или выключить возможность получения рефералов в боте";
$textbotlang['Admin']['Status']['affiliatesStatusOff'] = "Возможность получения рефералов отключена";
$textbotlang['Admin']['Status']['affiliatesStatuson'] = "Возможность получения рефералов включена";
$textbotlang['Admin']['Status']['commission'] = "Статус активации возможности подарка после старта бота";
$textbotlang['Admin']['Status']['commissionStatusOff'] = "Возможность комиссии отключена";
$textbotlang['Admin']['Status']['commissionStatuson'] = "Возможность комиссии активирована";
$textbotlang['Admin']['Status']['Discountaffiliates'] = "Статус активации возможности подарка";
$textbotlang['Admin']['Status']['DiscountaffiliatesStatusOff'] = "Возможность подарка отключена";
$textbotlang['Admin']['Status']['DiscountaffiliatesStatuson'] = "Возможность подарка активирована";
$textbotlang['Admin']['Status']['notusenameinbot'] = "🔍 Моё имя пользователя отсутствует в списке";

$textbotlang['Admin']['phone']['notactive'] = "🛑 Номер телефона не подтвержден 🛑";
$textbotlang['Admin']['phone']['active'] = "Номер телефона пользователя подтвержден ✅🎉";
$textbotlang['Admin']['phone']['NotSend'] = "Пользователь не отправил номер телефона";

$textbotlang['Admin']['Channel']['ReportChannel'] = "📣 В этом разделе вы можете отправить числовой ID канала или группы для отправки уведомления.
Чтобы получить числовой ID канала, вы можете отправить сообщение в канале и переслать отправленное сообщение на ID ниже, чтобы получить числовой ID.
Для группы вы можете добавить бота и отправить команду на получение ID, чтобы получить числовой ID группы.
        @myidbot
Ваш текущий числовой ID:";
$textbotlang['Admin']['Channel']['SetChannelReport'] ="🔰 Канал успешно настроен";
$textbotlang['Admin']['Channel']['TestChannel'] = "Тест отправки канала отчета";

$textbotlang['Admin']['Product']['Service_location'] ="📌 Выберите местоположение вашего продукта

 ⭕️ Чтобы определить продукт во всех местоположениях, отправьте команду /all";
$textbotlang['Admin']['Product']['nullpProduct']   = "⭕️ Продукт не найден, чтобы решить проблему, свяжитесь с поддержкой";
$textbotlang['Admin']['Product']['Rmove_location'] ="📌 Выберите местоположение вашего продукта";

$textbotlang['Admin']['Product']['selectRemoveProduct'] = "Выберите продукт, который хотите удалить";
$textbotlang['Admin']['Product']['selectEditProduct'] = "Выберите продукт, который хотите отредактировать";
$textbotlang['Admin']['Product']['selectfieldProduct'] = "Выберите поле, которое хотите отредактировать";
$textbotlang['Admin']['Product']['RemoveedProduct'] = "✅ Продукт успешно удалён.";
$textbotlang['Admin']['Product']['AddProductStepOne'] = "Сначала отправьте название подписки  
⚠️ Важные примечания при вводе названия подписки:  
• Вместе с названием подписки обязательно укажите её цену.  
• Вместе с названием подписки обязательно укажите срок подписки.";
$textbotlang['Admin']['Product']['GetLimit'] = "Отправьте объём подписки. Обратите внимание, единица измерения — гигабайт.  
Если вы хотите указать неограниченный объём, отправьте число 0.";
$textbotlang['Admin']['Product']['Invalidvolume'] = "Объём недействителен.";
$textbotlang['Admin']['Product']['GettIime'] = "Введите срок подписки. Обратите внимание, единица измерения — дни.  
Если вы хотите указать неограниченный срок, отправьте число 0.";
$textbotlang['Admin']['Product']['InvalidTime'] = "Срок недействителен.";
$textbotlang['Admin']['Product']['GetPrice'] = "Введите цену подписки.  
Примечание:  
Цена указывается в тугриках и отправляется без дополнительных символов.";
$textbotlang['Admin']['Product']['InvalidPrice'] = "Цена недействительна.";
$textbotlang['Admin']['Product']['SaveProduct'] = "Продукт успешно сохранён 🥳🎉.";
$textbotlang['Admin']['Product']['volumeUpdated'] = "✅ Объём продукта обновлён.";
$textbotlang['Admin']['Product']['TimeUpdated'] = "✅ Срок продукта обновлён.";
$textbotlang['Admin']['Product']['NewTime'] = "Введите новый срок.";

$textbotlang['Admin']['Payment']['reviewedpayment'] = "❌ Этот платёж уже был проверен другим администратором.";
$textbotlang['Admin']['Payment']['Reasonrejecting'] = "Введите причину отклонения платежа.";
$textbotlang['Admin']['Payment']['Rejected'] = "⭕️ Платёж успешно отклонён, и пользователю отправлено уведомление.";

$textbotlang['Admin']['Usertest']['TimeUpdated'] = "✅ Время тестового сервиса обновлено.";
$textbotlang['Admin']['Usertest']['VolumeUpdated'] = "✅ Объём тестового сервиса обновлён.";

$textbotlang['Admin']['Balance']['PriceBalance'] = "Получен числовой ID. Отправьте сумму, которую хотите добавить пользователю. Сумма указывается в тугриках.";
$textbotlang['Admin']['Balance']['PriceBalancek'] = "Получен числовой ID. Отправьте сумму, которую хотите вычесть у пользователя. Сумма указывается в тугриках.";
$textbotlang['Admin']['Balance']['Invalidprice'] = "Сумма недействительна.";
$textbotlang['Admin']['Balance']['AddBalanceUser'] = "✅ Сумма добавлена к балансу пользователя.";
$textbotlang['Admin']['Balance']['NegativeBalanceUser'] = "✅ Сумма вычтена из баланса пользователя.";
$textbotlang['Admin']['Balance']['addallbalance'] = "📌 Отправьте сумму для массового начисления.";

$textbotlang['Admin']['Discount']['GetCode'] = "Отправьте код для подарочного купона.";
$textbotlang['Admin']['Discount']['ErrorCode'] = "Код недействителен. Код должен быть на английском языке и без дополнительных символов.";
$textbotlang['Admin']['Discount']['PriceCode'] = "Код получен. Теперь отправьте сумму кода.";
$textbotlang['Admin']['Discount']['SaveCode'] = "✅ Код успешно зарегистрирован.";
$textbotlang['Admin']['Discount']['RemoveCode'] = "Выберите код, который хотите удалить.";
$textbotlang['Admin']['Discount']['RemovedCode'] = "✅ Код успешно удалён.";
$textbotlang['Admin']['Discount']['NotCode'] = "❌ Ошибка  
📝 Выбранного подарочного кода не существует.";

$textbotlang['Admin']['Protocol']['Title'] = "В этом разделе вы можете указать, какие протоколы будут предоставлены клиенту.  
📨 Для добавления протокола отправьте его из списка ниже.";
$textbotlang['Admin']['Protocol']['invalidProtocol'] = "❌ Протокол недействителен.";
$textbotlang['Admin']['Protocol']['AddedProtocol'] = "✅ Протокол добавлен.";
$textbotlang['Admin']['Protocol']['RemoveProtocol'] = "Выберите протокол, который хотите удалить.";
$textbotlang['Admin']['Protocol']['RemovedProtocol'] = "Протокол успешно удалён.";

$textbotlang['Admin']['AlgortimeUsername']['SaveData'] = "✅ Способ создания имени пользователя успешно обновлён.";

$textbotlang['Admin']['SettingPayment']['Savacard'] = "✅ Номер карты успешно зарегистрирован.";
$textbotlang['Admin']['SettingnowPayment']['Savaapi'] = "✅ Изменения успешно сохранены.";

$textbotlang['Admin']['perfectmoney']['setnumberacount'] = "✅ Номер аккаунта успешно зарегистрирован.";

$textbotlang['Admin']['Discountsell']['GetCode'] = "Отправьте код для скидки.";
$textbotlang['Admin']['Discountsell']['getlimit'] = "Отправьте ограничение на количество использований для пользователя.";
$textbotlang['Admin']['Discount']['PriceCodesell'] = "Код получен. Теперь отправьте процент скидки.";
$textbotlang['Admin']['Discount']['invalidcodedis'] = "❌ Код скидки недействителен.";

$textbotlang['Admin']['mesage']['nottextmessage'] = "❌ В массовой рассылке можно отправлять только текстовые сообщения.";
